```json
{
  "week": 8,
  "games": [
    {
      "away_team": "New York Jets",
      "away_abbr": "NYJ",
      "away_score": 39,
      "home_team": "Cincinnati Bengals",
      "home_abbr": "CIN",
      "home_score": 38,
      "summary": "Justin Fields orchestrated a remarkable comeback as the Jets snapped their seven-game losing streak with a thrilling 39-38 victory over Cincinnati. Breece Hall dominated the second half with two rushing touchdowns and a 4-yard TD pass with 1:54 remaining, accumulating 133 yards on 18 carries while the Jets racked up 502 total yards—their highest-scoring game of the season. After trailing 31-16 entering the fourth quarter, New York's defense and special teams execution proved crucial as Joe Flacco's two TD passes couldn't overcome the Jets' furious rally. The victory marked Aaron Glenn's first win as head coach after the team began 0-7, providing emotional relief for a franchise and players who had weathered weeks of criticism and doubt."
    },
    {
      "away_team": "Chicago Bears",
      "away_abbr": "CHI",
      "away_score": 16,
      "home_team": "Baltimore Ravens",
      "home_abbr": "BAL",
      "home_score": 30,
      "summary": "Derrick Henry powered the Ravens to a 30-16 victory over Chicago, rushing for two touchdowns and moving into fifth place on the all-time TD list with 112. Tyler Huntley delivered an efficient performance filling in for injured Lamar Jackson, completing 17 of 22 passes for 186 yards and orchestrating late-game drives that put the game away, including a critical 14-yard third-down completion to DeAndre Hopkins. The Bears' four-game winning streak came to a halt as they were held to just two field goals in the first quarter despite dominating early possessions, with Chicago's 11 penalties for 79 yards contributing to their downfall. Baltimore's defense forced a Caleb Williams interception near the goal line that led to a touchdown, showcasing the team's determination to capitalize on mistakes."
    },
    {
      "away_team": "Miami Dolphins",
      "away_abbr": "MIA",
      "away_score": 34,
      "home_team": "Atlanta Falcons",
      "home_abbr": "ATL",
      "home_score": 10,
      "summary": "Tua Tagovailoa threw a season-high four touchdown passes while wearing a protective helmet visor after waking up with a swollen eye, leading the Dolphins to a dominant 34-10 victory over Atlanta's short-handed roster. Tagovailoa completed 20 of 26 passes for 205 yards with scoring strikes to Jaylen Waddle, De'Von Achane, Malik Washington, and Ollie Gordon II, ending a three-game losing streak with his most impressive performance of the season. Miami's defense contained Bijan Robinson to just 25 rushing yards while the Dolphins outgained Atlanta 338-213, taking advantage of the Falcons' numerous injuries including Michael Penix Jr. and Drake London. The victory showcased Miami's offensive potential and provided coach Mike McDaniel with validation for his faith in Tagovailoa following the previous week's embarrassing 31-6 loss."
    },
    {
      "away_team": "Tennessee Titans",
      "away_abbr": "TEN",
      "away_score": 14,
      "home_team": "Indianapolis Colts",
      "home_abbr": "IND",
      "home_score": 38,
      "summary": "Jonathan Taylor became the first player in NFL history to score three touchdowns in three straight games against the same opponent, rushing for 153 yards on just 12 carries with TD runs of 18 and 80 yards plus a 19-yard receiving score in Indianapolis's dominant 38-14 rout. Daniel Jones orchestrated the league-best offense with three TD passes while limiting mistakes, and the Colts improved to an NFL-leading 7-1 behind a perfect display of complementary football that included 277 rushing yards. Michael Pittman Jr. caught eight passes for 95 yards and a career-tying sixth TD reception, showcasing how Taylor's explosiveness opens opportunities for teammates throughout the offense. Tennessee's defense was undermanned with three starters out, and the Titans have now lost six of seven games by double digits under interim coach Mike McCoy, with the Colts sweeping the season series by a combined 45 points."
    },
    {
      "away_team": "Dallas Cowboys",
      "away_abbr": "DAL",
      "away_score": 24,
      "home_team": "Denver Broncos",
      "home_abbr": "DEN",
      "home_score": 44,
      "summary": "Three rookies led Denver's explosive 44-24 victory over Dallas, with R.J. Harvey scoring three times, wide receiver Pat Bryant catching his first NFL touchdown, and first-rounder Jahdae Barron recording his first professional interception in a statement win. Bo Nix threw four TD passes while completing 15 of 20 attempts, showcasing remarkable efficiency as the Broncos extended their franchise-best home winning streak to nine games and improved to 6-2. J.K. Dobbins rushed for 111 yards complementing the rookie explosion, and Denver's defense forced multiple turnovers as the team scored on seven of eight possessions while overwhelmingly outgaining Dallas on the ground 179-108 yards. The Cowboys' inconsistency plagued them again after beating Washington the previous week, with Dak Prescott expressing frustration about the team's inability to maintain standards despite possessing quality players and coaches."
    },
    {
      "away_team": "Washington Commanders",
      "away_abbr": "WAS",
      "away_score": 7,
      "home_team": "Kansas City Chiefs",
      "home_abbr": "KC",
      "home_score": 28,
      "summary": "Patrick Mahomes rebounded from two early interceptions to dominate the second half, throwing three touchdown passes as Kansas City pulled away for a 28-7 Monday night victory over Washington, extending their winning streak to four of five games. Mahomes finished with 299 yards and perfect execution after halftime, connecting with Travis Kelce for his 83rd career TD to tie Priest Holmes' franchise record, plus touchdown passes to Rashee Rice and another score as the Chiefs held Washington scoreless in the final 30 minutes. Kareem Hunt found the end zone twice while rushing effectively, and Kansas City's defense proved suffocating after a chaotic first half featuring five empty drives and multiple turnovers by both offenses. Marcus Mariota's three turnovers for the Commanders prevented capitalization on early defensive stops, and Washington fell to 1-4 on the road as Kansas City extended its NFL record to nine straight wins over them."
    },
    {
      "away_team": "Buffalo Bills",
      "away_abbr": "BUF",
      "away_score": 40,
      "home_team": "Carolina Panthers",
      "home_abbr": "CAR",
      "home_score": 9,
      "summary": "James Cook rushed for a career-high 216 yards and two touchdowns as the Bills dominated Carolina 40-9 in their first game returning from a bye week, with Josh Allen setting an NFL record by becoming the first player to rush and throw for a touchdown in 46 consecutive games. Cook scored on runs of 64 and 21 yards while not appearing in the fourth quarter, becoming the third Bills running back to eclipse 200 yards with two TDs, as Buffalo's offense methodically dismantled a Panthers defense ranked eighth against the run. Allen added two short TD runs to tie Cam Newton's all-time quarterback TD mark while improving to 8-0 following bye weeks, completing 12 of 19 passes for 163 yards as the Bills sacked Andy Dalton seven times and forced three turnovers. Buffalo built a 19-3 halftime lead before extending to 40-3, with defensive end Michael Hoecht making his season debut after serving a suspension, providing an immediate spark for a defense seeking answers."
    },
    {
      "away_team": "San Francisco 49ers",
      "away_abbr": "SF",
      "away_score": 15,
      "home_team": "Houston Texans",
      "home_abbr": "HOU",
      "home_score": 26,
      "summary": "C.J. Stroud threw for a season-high 318 yards with two touchdowns, spreading the ball to nine different receivers in Nico Collins' absence due to a concussion, as Houston held off San Francisco 26-15 to bounce back from their loss to Seattle. Xavier Hutchinson led the receiving corps with a career-high 69 yards and a 30-yard touchdown grab, while rookie Jaylin Noel added 63 receiving yards as the Texans demonstrated offensive depth and flexibility despite losing a key target. Mac Jones struggled for San Francisco, throwing for 193 yards while getting pressured consistently, with the 49ers unable to generate offensive rhythm as they trailed by 16 before gaining traction late in the game. Houston's defense proved stingy down the stretch, with Kamari Lassiter intercepting Jones late in the game to seal the victory, marking just the second straight win for the Texans as they improved to 3-4."
    },
    {
      "away_team": "New York Giants",
      "away_abbr": "NYG",
      "away_score": 20,
      "home_team": "Philadelphia Eagles",
      "home_abbr": "PHI",
      "home_score": 38,
      "summary": "Saquon Barkley exploded for 150 yards and a 65-yard touchdown run on his opening carry before leaving with a groin injury, as the Eagles dominated New York 38-20 to even their season series and showcase their offensive firepower. Jalen Hurts completed 15 of 20 passes for 179 yards with four TD passes to Dallas Goedert (twice), Jahan Dotson, and Barkley, orchestrating an offense that amassed 277 rushing yards and completely controlled the line of scrimmage. The Eagles' defense forced multiple turnovers while Philadelphia's run game established dominance early, with Tank Bigsby stepping in to rush for 104 yards after Barkley departed, demonstrating the depth of the Eagles' attacking arsenal. Jaxson Dart threw for 193 yards with a touchdown for the Giants, who suffered a serious blow when rookie Cam Skattebo dislocated his right ankle and required surgery, while New York's defense was overwhelmed by Philadelphia's balanced attack."
    },
    {
      "away_team": "Cleveland Browns",
      "away_abbr": "CLE",
      "away_score": 13,
      "home_team": "New England Patriots",
      "home_abbr": "NE",
      "home_score": 32,
      "summary": "Drake Maye threw three second-half touchdown passes as the Patriots extended their winning streak to five games with a 32-13 victory over Cleveland, bouncing back from early deficits to demonstrate offensive cohesion and resilience. Maye finished 18 of 24 for 282 yards with TD passes to Hunter Henry, Stefon Diggs, and Kayshon Boutte, while also adding two rushing touchdowns as New England improved to 6-2 in coach Mike Vrabel's first season. The Patriots' defense forced multiple interceptions including picks by Jaylinn Hawkins and Robert Spillane, making life difficult for Browns rookie Dillon Gabriel who was 21 of 35 for 156 yards with two TDs and two picks. Myles Garrett recorded a franchise-record five sacks to reach 10 on the season, but his dominant performance couldn't overcome the Patriots' second-half execution as Cleveland's 12-game road losing streak extended."
    },
    {
      "away_team": "Tampa Bay Buccaneers",
      "away_abbr": "TB",
      "away_score": 23,
      "home_team": "New Orleans Saints",
      "home_abbr": "NO",
      "home_score": 3,
      "summary": "Anthony Nelson recorded an interception for a touchdown, a forced fumble, and two sacks in one of the most complete performances of his career, leading Tampa Bay to a dominant 23-3 win over the struggling Saints on Sunday. Nelson tipped a Spencer Rattler pass to himself for his first career TD, essentially walking into the end zone as the Buccaneers' defense forced four turnovers while completely shutting down New Orleans' offense. Sean Tucker scored on a controversial fourth-down dive to help seal the victory, while Antoine Winfield Jr. recovered a fumble and intercepted a pass to further frustrate the Saints' offense. The Buccaneers' win improved them to 6-2 despite an inefficient passing attack from Baker Mayfield (152 yards), while New Orleans rotated quarterbacks after inserting rookie Tyler Shough late in the game and fell to 1-7 to match the league's worst record."
    },
    {
      "away_team": "Green Bay Packers",
      "away_abbr": "GB",
      "away_score": 35,
      "home_team": "Pittsburgh Steelers",
      "home_abbr": "PIT",
      "home_score": 25,
      "summary": "Jordan Love completed 29 of 35 passes for 360 yards and three touchdowns, tying a franchise record with 20 consecutive completions spanning halftime, in Green Bay's 35-25 Sunday night statement win over his predecessor Aaron Rodgers and the Steelers. Love orchestrated an explosive offensive attack that generated 454 total yards while the Packers' defense stymied Pittsburgh's usually dominant unit in the second half, proving the transfer of power was complete as the young quarterback outdueled the 41-year-old Rodgers. Tucker Kraft caught seven passes for 143 yards and two touchdowns, while Christian Watson added four receptions for 85 yards in his return from injury, showcasing the talent surrounding Love in Green Bay's aerial assault. Rodgers completed 24 of 36 for 219 yards with two scores but couldn't keep pace, as the Packers won at Pittsburgh for the first time since 1970, with Green Bay improving to 5-1-1 while Pittsburgh fell to 4-3."
    },
    {
      "away_team": "Minnesota Vikings",
      "away_abbr": "MIN",
      "away_score": 10,
      "home_team": "Los Angeles Chargers",
      "home_abbr": "LAC",
      "home_score": 37,
      "summary": "Justin Herbert threw for 227 yards and three touchdowns while rushing for 62 yards in the Chargers' dominant 37-10 Thursday night victory over Minnesota, bouncing back decisively from a devastating loss to Indianapolis the previous Sunday. Los Angeles' offense didn't punt and converted 29 first downs to Minnesota's 12, with Herbert distributing TD passes to Oronde Gadsden II, Ladd McConkey, and Tre' Harris while Kimani Vidal rushed for 117 yards and a score. The Chargers (5-3) scored 30 or more points for the first time this season against a Vikings defense that allowed Carson Wentz to be sacked five times on short rest, with Minnesota's offense held to just 21 minutes of possession in a lopsided affair. Keenan Allen reached 11,000 career receiving yards to join Antonio Gates as the only players in franchise history to achieve that milestone, while the Vikings' three-game losing streak in five days demonstrated the challenges of managing injuries and scheduling despite starting 3-4."
    },
    {
      "away_team": "Baltimore Ravens",
      "away_abbr": "BAL",
      "away_score": 28,
      "home_team": "Miami Dolphins",
      "home_abbr": "MIA",
      "home_score": 6,
      "summary": "Lamar Jackson threw four touchdown passes with minimal rust in his return from a hamstring injury, leading Baltimore to a dominant 28-6 Thursday night victory over Miami that positioned the Ravens favorably in a wide-open AFC North. Jackson completed 18 of 23 passes for 204 yards and connected with Mark Andrews twice, Charlie Kolar, and Rashod Bateman for TD strikes while completing his first nine second-half passes before one incompletion late in the third quarter. Derrick Henry rushed for 119 yards on 19 carries as Baltimore's offensive machine dominated from start to finish, with Miami's offense held to just one field goal before a late fourth-quarter touchdown drive that came too late to matter. The Ravens' defense forced multiple Miami turnovers including a crucial fumble by Malik Washington at the 10-yard line, while the Dolphins' 80-yard scoring drive showcased too little too late as Baltimore improved to 3-5 with their second straight dominant performance heading into their